# SQL - Window Function 
    What are Window Functions?
    Window functions perform calculations across a set of rows related to the current row,
    WITHOUT collapsing rows like GROUP BY.
    -> Key difference:
    - GROUP BY → reduces rows
    - Window Function → keeps all rows + adds analysis

    -> Basic Syntax
    
    function_name (expression)
    OVER (
        PARTITION BY column
        ORDER BY column
        ROWS / RANGE frame
    )

    function_name	-> Aggregate / ranking / analytic function
    OVER()	        -> Defines the window
    PARTITION BY	-> Divides data into groups (optional)
    ORDER BY	    -> Defines row order inside window
    ROWS / RANGE	-> Controls window frame (optional)

### Database Connection

In [7]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [9]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using Already Created table employees

In [12]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

## 1. Aggregate Window Functions
    Aggregate Window Functions apply aggregate calculations (like SUM, AVG, COUNT, etc.) over a window of rows while keeping each row visible.

### Show each employee’s salary and average salary of all employees

In [26]:
%%sql
select emp_name,salary,
           avg(salary) over() as avg_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Vikas', 40000, Decimal('60000.0000')),
 ('Neha', 45000, Decimal('60000.0000')),
 ('Sneha', 50000, Decimal('60000.0000')),
 ('Amit', 60000, Decimal('60000.0000')),
 ('Arjun', 65000, Decimal('60000.0000')),
 ('Rahul', 75000, Decimal('60000.0000')),
 ('Priya', 85000, Decimal('60000.0000'))]

### Display employee salary and department-wise average salary

In [33]:
%%sql
select emp_name, department, salary,
                avg(salary) over(partition by department) as avg_dep_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Sneha', 'Finance', 50000, Decimal('57500.0000')),
 ('Arjun', 'Finance', 65000, Decimal('57500.0000')),
 ('Neha', 'HR', 45000, Decimal('42500.0000')),
 ('Vikas', 'HR', 40000, Decimal('42500.0000')),
 ('Amit', 'IT', 60000, Decimal('73333.3333')),
 ('Priya', 'IT', 85000, Decimal('73333.3333')),
 ('Rahul', 'IT', 75000, Decimal('73333.3333'))]

### Show total salary of each department for every employee

In [36]:
%%sql
select emp_name, department, salary,
                sum(salary) over(partition by department) as avg_dep_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Sneha', 'Finance', 50000, Decimal('115000')),
 ('Arjun', 'Finance', 65000, Decimal('115000')),
 ('Neha', 'HR', 45000, Decimal('85000')),
 ('Vikas', 'HR', 40000, Decimal('85000')),
 ('Amit', 'IT', 60000, Decimal('220000')),
 ('Priya', 'IT', 85000, Decimal('220000')),
 ('Rahul', 'IT', 75000, Decimal('220000'))]

### Find difference between employee salary and department average

In [44]:
%%sql
SELECT emp_name, department, salary,
       salary - AVG(salary) OVER(PARTITION BY department) AS diff_from_avg
FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Sneha', 'Finance', 50000, Decimal('-7500.0000')),
 ('Arjun', 'Finance', 65000, Decimal('7500.0000')),
 ('Neha', 'HR', 45000, Decimal('2500.0000')),
 ('Vikas', 'HR', 40000, Decimal('-2500.0000')),
 ('Amit', 'IT', 60000, Decimal('-13333.3333')),
 ('Priya', 'IT', 85000, Decimal('11666.6667')),
 ('Rahul', 'IT', 75000, Decimal('1666.6667'))]

### Show min & max salary in each department

In [55]:
%%sql
select emp_name, department, salary,
min(salary) over(partition by department) as dep_min_salary,
max(salary) over(partition by department) as dep_max_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Sneha', 'Finance', 50000, 50000, 65000),
 ('Arjun', 'Finance', 65000, 50000, 65000),
 ('Neha', 'HR', 45000, 40000, 45000),
 ('Vikas', 'HR', 40000, 40000, 45000),
 ('Amit', 'IT', 60000, 60000, 85000),
 ('Priya', 'IT', 85000, 60000, 85000),
 ('Rahul', 'IT', 75000, 60000, 85000)]

### 2. Ranking Window Function 
    Ranking Window Functions assign a rank or position number to each row within a window based on a specified order.
    - Used to rank, order, or bucket rows
    - Very common in top-N, leaderboards, analytics

    -> Common Ranking Window Functions
        ROW_NUMBER() ->	Unique number, no ties
        RANK()	     -> Same rank for ties, gaps allowed
        DENSE_RANK() ->	Same rank for ties, no gaps
        NTILE(n)	 -> Divides rows into n groups

### Rank employees by salary within each department

In [67]:
%%sql
select emp_name, department, salary,
rank() over(partition by department order by salary desc) as rank_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 1),
 ('Sneha', 'Finance', 50000, 2),
 ('Neha', 'HR', 45000, 1),
 ('Vikas', 'HR', 40000, 2),
 ('Priya', 'IT', 85000, 1),
 ('Rahul', 'IT', 75000, 2),
 ('Amit', 'IT', 60000, 3)]

### Show ROW_NUMBER, RANK, DENSE_RANK together

In [72]:
%%sql
select emp_name, department, salary,
rank() over(partition by department order by salary desc) as rank_salary,
row_number() over(partition by department order by salary desc) as row_number_salary,
dense_rank() over(partition by department order by salary desc) as dense_rank_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 1, 1, 1),
 ('Sneha', 'Finance', 50000, 2, 2, 2),
 ('Neha', 'HR', 45000, 1, 1, 1),
 ('Vikas', 'HR', 40000, 2, 2, 2),
 ('Priya', 'IT', 85000, 1, 1, 1),
 ('Rahul', 'IT', 75000, 2, 2, 2),
 ('Amit', 'IT', 60000, 3, 3, 3)]

### Find highest paid employee in each department

In [85]:
%%sql
select * from (
select emp_name, department, salary,
rank() over(partition by department order by salary desc) as high_paid_emp
from employees) t
where high_paid_emp = 1;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Arjun', 'Finance', 65000, 1),
 ('Neha', 'HR', 45000, 1),
 ('Priya', 'IT', 85000, 1)]

### Find top 3 salaries in each department

In [88]:
%%sql
select * from (
    select emp_name, department, salary,
    rank() over(partition by department order by salary desc) rnk
    from employees
)t
where rnk <= 3;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 1),
 ('Sneha', 'Finance', 50000, 2),
 ('Neha', 'HR', 45000, 1),
 ('Vikas', 'HR', 40000, 2),
 ('Priya', 'IT', 85000, 1),
 ('Rahul', 'IT', 75000, 2),
 ('Amit', 'IT', 60000, 3)]

### Divide employees into salary groups (quartiles)

In [103]:
%%sql
select emp_name, department, salary,
ntile(2) over(partition by department order by salary desc) as quartiles
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 1),
 ('Sneha', 'Finance', 50000, 2),
 ('Neha', 'HR', 45000, 1),
 ('Vikas', 'HR', 40000, 2),
 ('Priya', 'IT', 85000, 1),
 ('Rahul', 'IT', 75000, 1),
 ('Amit', 'IT', 60000, 2)]

### Find second highest salary in each department

In [105]:
%%sql
select * from (
    select emp_name, department, salary,
    rank() over(partition by department order by salary) as sec_rank
    from employees
)t
where sec_rank = 2;

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[('Arjun', 'Finance', 65000, 2),
 ('Neha', 'HR', 45000, 2),
 ('Rahul', 'IT', 75000, 2)]

### 3. Value Window Functions
    Value Window Functions allow access to values from other rows relative to the current row.

    -> Common Value Window Function 
        LAG()	     -> Previous row value
        LEAD()	     -> Next row value
        FIRST_VALUE() -> First value in window
        LAST_VALUE()  -> Last value in window

### Show previous employee’s salary

In [115]:
%%sql
select emp_name, joining_date, salary,
lag(salary) over(order by joining_date) as previous_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Priya', datetime.date(2018, 4, 25), 85000, None),
 ('Vikas', datetime.date(2019, 8, 12), 40000, 85000),
 ('Rahul', datetime.date(2020, 1, 20), 75000, 40000),
 ('Arjun', datetime.date(2020, 9, 18), 65000, 75000),
 ('Neha', datetime.date(2021, 3, 15), 45000, 65000),
 ('Amit', datetime.date(2022, 6, 10), 60000, 45000),
 ('Sneha', datetime.date(2022, 11, 5), 50000, 60000)]

### Show next employee’s salary

In [113]:
%%sql
select emp_name, joining_date, salary,
lead(salary) over(order by joining_date) as next_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Priya', datetime.date(2018, 4, 25), 85000, 40000),
 ('Vikas', datetime.date(2019, 8, 12), 40000, 75000),
 ('Rahul', datetime.date(2020, 1, 20), 75000, 65000),
 ('Arjun', datetime.date(2020, 9, 18), 65000, 45000),
 ('Neha', datetime.date(2021, 3, 15), 45000, 60000),
 ('Amit', datetime.date(2022, 6, 10), 60000, 50000),
 ('Sneha', datetime.date(2022, 11, 5), 50000, None)]

### Show salary growth compared to previous hire

In [118]:
%%sql
select emp_name, joining_date, salary,
salary - lag(salary) over(order by joining_date) as growth_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Priya', datetime.date(2018, 4, 25), 85000, None),
 ('Vikas', datetime.date(2019, 8, 12), 40000, -45000),
 ('Rahul', datetime.date(2020, 1, 20), 75000, 35000),
 ('Arjun', datetime.date(2020, 9, 18), 65000, -10000),
 ('Neha', datetime.date(2021, 3, 15), 45000, -20000),
 ('Amit', datetime.date(2022, 6, 10), 60000, 15000),
 ('Sneha', datetime.date(2022, 11, 5), 50000, -10000)]

### Compare salary with previous employee in same department

In [125]:
%%sql
select emp_name, joining_date, salary, department,
lag(salary) over(partition by department order by joining_date) as pre_dep_salary
from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', datetime.date(2020, 9, 18), 65000, 'Finance', None),
 ('Sneha', datetime.date(2022, 11, 5), 50000, 'Finance', 65000),
 ('Vikas', datetime.date(2019, 8, 12), 40000, 'HR', None),
 ('Neha', datetime.date(2021, 3, 15), 45000, 'HR', 40000),
 ('Priya', datetime.date(2018, 4, 25), 85000, 'IT', None),
 ('Rahul', datetime.date(2020, 1, 20), 75000, 'IT', 85000),
 ('Amit', datetime.date(2022, 6, 10), 60000, 'IT', 75000)]

### Get first and last hired employee’s salary in each department

In [131]:
%%sql
SELECT emp_name, department, salary,
FIRST_VALUE(salary) OVER(PARTITION BY department ORDER BY joining_date) AS first_salary,
last_VALUE(salary) OVER(PARTITION BY department ORDER BY joining_date) AS last_salary
FROM employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[('Arjun', 'Finance', 65000, 65000, 65000),
 ('Sneha', 'Finance', 50000, 65000, 50000),
 ('Vikas', 'HR', 40000, 40000, 40000),
 ('Neha', 'HR', 45000, 40000, 45000),
 ('Priya', 'IT', 85000, 85000, 85000),
 ('Rahul', 'IT', 75000, 85000, 75000),
 ('Amit', 'IT', 60000, 85000, 60000)]